package repositories

import (
	"database/sql"
)

type AppointmentRepository struct {
	DB *sql.DB
}

func NewAppointmentRepository(db *sql.DB) *AppointmentRepository {
	return &AppointmentRepository{DB: db}
}

// =====================================================================
// 👩‍💻 พื้นที่ของ: ปลา (Insert นัดใหม่)
// =====================================================================
func (r *AppointmentRepository) CreateAppointment() {

}

// =====================================================================
// 👩‍💻 พื้นที่ของ: นุช (อัปเดตข้อมูลนัดหมาย)
// =====================================================================
func (r *AppointmentRepository) UpdateAppointment() {

}

// =====================================================================
// 👨‍💻 พื้นที่ของ: เอลฟ์ (ลบข้อมูลนัดหมาย)
// =====================================================================
func (r *AppointmentRepository) CancelAppointment() {

}

// =====================================================================
// 👨‍💻 พื้นที่ของ: พี่สิรภพ (ดึงรายการนัดพร้อม Filter)
// =====================================================================
func (r *AppointmentRepository) GetAppointments() {

}

// =====================================================================
// 👨‍💻 พื้นที่ของ: พี่อิทธิเชษฐ์ (อัปเดตสถานะการรักษา)
// =====================================================================
func (r *AppointmentRepository) UpdateStatus() {

}
